Revit 2027 API
PathOfTravel.PathMidpoint Property
 The midpoint of the path. The Z coordinate will equal the view's level elevation.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ PathMidpoint { get; }
Public ReadOnly Property PathMidpoint As XYZ
	Get
public:
property XYZ^ PathMidpoint {
	XYZ^ get ();
}
member PathMidpoint : XYZ with get
Property Value
XYZ
See Also
Reference
PathOfTravel Class
Autodesk.Revit.DB.Analysis Namespace